CSI API ETABS v1
cPointElm Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPointElm
Public Interface cPointElm
Dim instance As cPointElm
public interface class cPointElm
type cPointElm =  interface end
The cPointElm type exposes the following members.
Methods
Name | Description
Count
CountConstraint
CountLoadDispl
CountLoadForce
CountRestraint
CountSpring
GetConnectivity
GetConstraint
GetCoordCartesian
GetLoadDispl
GetLoadForce
GetLocalAxes
GetNameList
GetObj
GetPatternValue
GetRestraint
GetSpring
GetSpringCoupled
GetTransformationMatrix
IsSpringCoupled
Top
See Also
Reference
ETABSv1 Namespace